Autodesk.DesignScript.Geometry.Geometry.ProjectMany(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector)
Projects a collection of Points onto this Geometry along the specified direction.
Returns a flat array of resulting Geometry.
points: Points to project
projectionDirection: Projection direction
Returns: Flat array of resulting Geometry
project points,batch project