Autodesk.DesignScript.Geometry.Mesh.ByVerticesAndIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{System.Int32})
Create a new Mesh from supplied vertices and indices. Vertices should
not overlap. Indices should be sets of three integers
indicating the three locations in the virtices array
of the three points of a triangle

Autodesk.DesignScript.Geometry.Mesh.ByPointsIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{System.Int32})
Create a new Mesh from supplied points and indices. Points should
not overlap. Indices should be sets of three integers
indicating the three locations in the points array
of the three points of a triangle

Autodesk.DesignScript.Geometry.Mesh.Plane(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32)
Create a mesh plane based on the current settings.
origin:
xWidth:
yWidth:
xDivisions:
yDivisions:
mesh

Autodesk.DesignScript.Geometry.Mesh.BooleanIntersection(Autodesk.DesignScript.Geometry.Mesh)
Returns a new mesh consistenting of the intersection between the tool
mesh and the original mesh.
tool:
mesh

Autodesk.DesignScript.Geometry.Mesh.Repair
Returns a new Mesh with the following defects repaired:
Small components: if the Mesh contains a very small, disconnected
segments, relative to the overall Mesh size, they will be
discarded.
Holes: holes in the mesh are filled in
Non-manifold regions: if a vertex is connected to more than
two *boundary* edges, or an edge is connected to more than
two triangles then the vertex / edge is non-manifold. The
mesh toolkit will remove geometry until the mesh is manifold
This method tries to preserve as much of the original mesh as
possible, as opposed to MakeWatertight, which resamples the Mesh

Autodesk.DesignScript.Geometry.Mesh.MakeWatertight
Returns a new Mesh that is watertight and 3D printable. As a result of
making a Mesh watertight, self-intersections, overlaps, and non-manifold
geometry is removed from the mesh. The method computes a thin-band distance
field and generates a new Mesh using marching cubes but doesn't project
back onto the original Mesh.
Basically the Mesh is filled with a bunch of tiny boxes, and a new
mesh is created around this.

Autodesk.DesignScript.Geometry.Mesh.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Rotate the Mesh around the input axis by input degrees. Rotation
is centered at the origin

Autodesk.DesignScript.Geometry.Mesh.Scale(System.Double,System.Double,System.Double)
Scale Mesh non-uniformally by scale factors