Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Returns the angle between the two Vectors, in the range [0, 180] degrees.
Returns the angle between the two vectors in degrees from 0 to 360. It uses axis of rotation to determine the direction of the angle.
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,