Autodesk.DesignScript.Geometry.Properties.Resources.mesh_bypointsfaceindices_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use  Mesh.ByPointsIndexGroups (Point[] points, IndexGroups : IndexGroup[]) instead.

Autodesk.DesignScript.Geometry.Properties.Resources.point_project_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use Geometry.ProjectMany(Point[] points, Vector projectionDirection) instead.