Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Make PolyCurve by joining curves. Input curves need not be specified in order of connectivity.
PolyCurve direction is based on the first curve in the input array.
Choose a preferred join tolerance between 1e-6 and 1e-3 units.
curves:  Curves to join into a polycurve
joinTolerance:  Tolerance to determine size of gap allowed between curves to be joined
Returns:  Polycurve created by joined curves
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Make PolyCurve by joining curves. Input curves need not be specified in order of connectivity.
PolyCurve direction is based on the first curve in the input array.
Choose a preferred join tolerance between 1e-6 and 1e-3 units.
curves:  Curves to join into a polycurve
joinTolerance:  Tolerance to determine size of gap allowed between curves to be joined
trimCurves:  Set to True if input curves are intersecting/overlapping each other and need their end segments to be trimmed off before creation of PolyCurve. It is set to False by default.
trimLength:  If trimLength is greater than 0 then end segments longer than trimLength will not be trimmed.
Returns:  Polycurve created by joined curves
segments,joincurves