Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Generates a T-spline primitive plane surface using an origin point and normal vector
origin: Root point of plane
normal: Normal of plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,origin,normal

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates an "oriented" T-spline plane, positioned at Point origin with Vector normal, but with a specific X-axis orientation.
This has no impact on splitting, intersect, project, etc. operations; it only specifies the orientation of the input CoordinateSystem.
origin: Root point of plane
normal: Normal of plane
xAxis: X-axis of plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline primitive plane surface by origin and X and Y axes.
The Z-axis is the cross product of the two vectors.
origin: Root point of plane
xAxis: X-axis of plane
yAxis: Y-axis of plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Generates a T-spline primitive plane surface from a list of points
points: A set of points to fit to plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,fit,bestfit,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Generates a T-spline primitive plane surface from a line and a point. The point cannot lie on the line or anywhere on the line's axis.
line: Line to build a plane
point: Point to build a plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,line,point

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Generates a T-spline primitive plane surface using three points as input. The points cannot lie on a straight line.
p1: First point to build a plane
p2: Second point to build a plane
p3: Third point to build a plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,line,point

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCylinderRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Constructs a T-spline cylinder surface defined by a given Coordinate System, radius, and height
cs: Center and base of cylinder will be fit at X-Y plane of this coordinate system
radius: Radius of a cylinder
height: Height of a cylinder
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Cylindric T-Spline Surface
tspline,cylinder,radius,height

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCylinderPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Constructs a T-spline cylinder surface given the bottom and top center point of the cylinder
startPoint: Start point of a cylinder
endPoint: End point of a cylinder
radius: Radius of a cylinder
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Cylindric T-Spline Surface
tspline,cylinder,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline cone surface with a given base radius at the start point,
extending to an apex at the end point
startPoint: Start point of a cone
endPoint: End point of a cone
radius: Radius of the base of the cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline cone surface with axis from start point to end point, with given radii at start and end.
This object does not have an apex and is in the shape of a frustum.
startPoint: Start point of a cone
endPoint: End point of a cone
startRadius: Start radius of a cone
endRadius: End radius of a cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline cone with a base point at the Coordinate System origin, extending in the direction of the Coordinate System Z-axis,
with its circular base in the Coordinate System XY plane
cs: Center and base of cone will be fit at X-Y plane of this coordinate system
height: Height of a cone
radius: Radius of a cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline cone with a base point at the Coordinate System origin, extending in the direction of the Coordinate System Z-axis,
with its circular base in the Coordinate System XY plane
cs: Center and base of will be fit at X-Y plane of this coordinate system
height: Height of a cone
startRadius: Start radius of a cone
endRadius: End radius of a cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline sphere centered at the input point, with a given radius
centerPoint: Center of a sphere
radius: Radius of a sphere
radiusSpans: Number of radial spans
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Spherical T-Spline Surface
tspline,sphere,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline sphere from four input points
points: Four points in list to build a sphere. Points should not be coplanar
radiusSpans: Number of radial spans
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Spherical T-Spline Surface
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereBestFit(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline sphere that fits as closely as possible to the input points
points: Set of points to fit a sphere
radiusSpans: Number of radial spans
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Spherical T-Spline Surface
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline torus centered at Coordinate System origin, with given radii
cs: Torus will be aligned in the X-Y plane of given coordinate system with center in its origin
innerRadius: Inner radius of a torus
outerRadius: Outer radius of a torus
innerRadiusSpans: Number of inner radial spans
outerRadiusSpans: Number of outer radial spans
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Toroidal T-Spline Surface
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline torus with a given center and radii, aligned with the default world XY plane
center: Center of a torus
innerRadius: Inner radius of a torus
outerRadius: Outer radius of a torus
innerRadiusSpans: Number of inner radial spans
outerRadiusSpans: Number of outer radial spans
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Toroidal T-Spline Surface
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline box centered around the World Coordinate System origin, with a given width, length, and height
width: Width of a box
length: Length of a box
height: Height of a box
xSpans: Number spans in width
ySpans: Number spans in length
zSpans: Number spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Cuboid
tspline,box,cuboid,cube,size

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline box centered around an input point, with a given width, length, and height
origin: Center of a box
width: Width of a box
length: Length of a box
height: Height of a box
xSpans: Number spans in width
ySpans: Number spans in length
zSpans: Number spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Cuboid
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline box centered and oriented to the input Coordinate System, with a given width, length, and height
cs: X-Y plane of box will be aligned with corresponding X
width: Width of a box
length: Length of a box
height: Height of a box
xSpans: Number spans in width
ySpans: Number spans in length
zSpans: Number spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Cuboid
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline box spanning from low point to high point
lowPoint: First corner point
highPoint: Second corner point
xSpans: Number spans in width
ySpans: Number spans in length
zSpans: Number spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Cuboid
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline quadball centered at Coordinate System origin, with a given radius
cs: Local coordinate system
radius: Quadball radius
spans: Spans number in two dimensions of sides of Quadball
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Quadball
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline quadball with a given center and radius, aligned with the default world XY plane
center: Quadball center point
radius: Quadball radius
spans: Spans number in two dimensions of sides of Quadball
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Quadball
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Constructs a T-spline surface from a NURBS surface using uniform strategy.
Input NURBS surface is rebuilt with uniform knots placed at equal parametric or
arc length intervals depending on corresponding useArcLen flag, and approximated by
degree 3 NURBS surface. Output T-Spline is divided by given span counts
in u and v directions.
nurbsSurface: Input NURBS surface
uSpans: Required spans number in u direction
vSpans: Required spans number in v direction
uUseArcLen: Whether to use arc length or parametric subdivision in u parametric direction
vUseArcLen: Whether to use arc length or parametric subdivision in v parametric direction
inSmoothMode: Show T-Spline Surface in box or smooth visualization
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
Constructs a T-spline surface from a NURBS surface using curvature subdivision strategy
Input NURBS surface is rebuilt to degree 3. Output T-spline has span counts and
positions in each direction detected automatically depending on curvature.
nurbsSurface: Input NURBS surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByExtrude(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Constructs a T-spline by extruding a curve along the given vector
curve: Profile curve
direction: Extrude vector
frontDistance: Extrude distance in vector direction
backDistance: Extrude distance against vector direction
frontSpans: Spans number by vector direction. No extrusion in vector direction will be performed if 0 is passed
backSpans: Spans number against vector direction. No extrusion against vector direction will be performed if 0 is passed
profileSpans: Spans number in profile direction. Automatically defined if 0 or less
uniform: Use uniform or curvature strategy for spans distribution along profile direction
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,extrude,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Constructs a T-spline by sweeping a cross section curve along a path
profile: Profile curve
path: Path curve
parallel: If spans should be parallel in path direction
pathSpans: Spans number in path
profileSpans: Spans number in profile. Automatically defined if 0 or less
pathUniform: Use uniform or curvature strategy for spans distribution along path
profileUniform: Use uniform or curvature strategy for spans distribution along profile
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creates a T-spline surface by sweeping the profile curve around the axis formed
by the axis origin and axis direction, starting at start_angle in degrees,
and sweeping by sweep_angle in degrees
profile: Profile curve
axisOrigin: Rotation center
axisDirection: Rotation axis
startAngle: Angle to start rotation from
sweepAngle: Angle to finish rotation at
radialSpans: Spans number in radius
axialSpans: Spans number in height. Automatically defined if 0 or less
uniform: Use uniform or curvature strategy for spans distribution
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildFromLines(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Double,System.Boolean,System.Boolean)
Creates a T-spline surface from a list of lines.
Accepts curves, but takes only start and end points from them.
lines: Lines to build T-Spline from. Only endpoints are used
maxFaceValence: The maximum number of adjusted faces
snappingTolerance: The curve-curve intersection tolerance
creaseOuterVertices: Whether to crease vertices with valence 2 or not
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,line,build

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Creates a T-spline piped surface using a network of curves or lines.
A smooth joint is created at each curve intersection.
Some parameters take a single value or a list, one value per curve.
curves: A list of curves to create pipes from
defaultRadius: Default radius for created pipes
snappingTolerance: The tolerance used to detect curve intersections
segmentsCount: Numbers of segments for each curve. The size of the list can be the curve count or 1 for replication or 0 for automatic determination.
autoHandleStart: If true, the parameters of the handle at the start of each curve are automatically generated, and the custom parameters of rotationsAtStart, radiiAtStart, and positionsAtStart are ignored.
autoHandleEnd: If true, the parameters of the handle at the end of each curve are automatically generated, and the custom parameters of rotationsAtEnd, radiiAtEnd, and positionsAtEnd are ignored.
startRotations: Custom rotation angle in degrees for each pipe handle at the start of each curve. This parameter is ignored when autoHandleStart is true. The size of the list can be the curve count or 1 for replication.
endRotations: Custom rotation angle in degrees for each pipe handle at the end of each curve. This parameter is ignored when autoHandleEnd is true. The size of the list can be the curve count or 1 for replication.
startRadii: Custom radius for each pipe handle at the start of each curve. This parameter is ignored when autoHandleStart is true. The size of the list can be the curve count or 1 for replication.
endRadii: Custom radius for each pipe handle at the end of each curve. This parameter is ignored when autoHandleEnd is true. The size of the list can be the curve count or 1 for replication.
startPositions: Custom position of each pipe handle at the start of each curve in percentage between 0 and 1 along the arc-length of curve. This parameter is ignored when autoHandleStart is true. The size of the list can be the curve count or 1 for replication. The start and end position should not overlap each other on each curve. Ideally, the start position should be close to 0, while the end position close to 1.
endPositions: Custom position of each pipe handle at the end of each curve in percentage between 0 and 1 along the arc-length of curve. This parameter is ignored when autoHandleEnd is true. The size of the list can be the curve count or 1 for replication. The start and end position should not overlap each other on each curve. Ideally, the start position should be close to 0, while the end position close to 1.
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
Combines given T-spline surfaces into a single one.
Surfaces can be disjoint.
If at least one surface is in box mode, the output surface will be in box mode as well.
Note: All input surfaces must have the same version in order to be combined successfully. For this reason, one or more surfaces may be cloned internally and their versions either upgraded or downgraded to match the version currently used in Dynamo. The resulting surface may therefore have subtle differences from what might be the expected result. The input surfaces themselves will remain unchanged.
tSplineSurfaces: T-Spline Surfaces to combine
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Reflections
Returns a list of reflections applied to a given T-spline
tspline,symmetry,reflections

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
Returns True if a given T-spline is in box mode
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsExtractable
Returns True if a given T-spline is extractable (could be displayed in smooth mode)
tspline,extractable

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
Returns True if a given T-spline is closed
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsWaterTight
Returns True if a given T-spline is watertight. All closed surfaces are watertight, but some watertight surfaces are open.
tspline,watertight

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsStandard
Returns True if a given T-spline is standard (all T-points are separated from star points by at least two isocurves)
tspline,standard

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Converts the given T-spline surface to solid or surface depending on shape.
Note: There could be subtle unexpected changes in the resulting BRep surface if the input surface is created in a higher T-spline version than the version loaded in Dynamo. In this case, a copy of the surface will be downgraded to the Dynamo version and used in the conversion.
matchTopology: Determines if the resulting body should have the same topology as the input TSpline surface.
Returns: Topology entity (Solid or Surface)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
Converts the given T-spline surface to a mesh. The mesh can have both triangles and quads.
minSegments: The minimum number of segments in each direction. At least one segment will always be produced.
tolerance: Maximum allowed distance from the mesh to the surface. Setting to a zero or a negative value will disable its use
Returns: Mesh entity
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Thicken(System.Double,System.Boolean)
Thickens the given T-spline surface by the given distance in the direction of its face normals
distance: Distance to thicken
softEdges: Determines if resulting edges should be creased
Returns: Thickened TSpline surface
tspline,thicken,normal

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Thicken(Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Thickens the given T-spline surface by the given vector
vector: Direction to thicken
softEdges: Determines if resulting edges should be creased
Returns: Thickened TSpline surface
tspline,thicken,vector

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreaseEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Adds a crease to the given edge on a T-spline surface
edges: Edges to crease
Returns: TSpline surface with creased edges
tspline,edge,crease

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UncreaseEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Removes the crease from the given set of edges
edges: Edges to uncrease
Returns: TSpline surface with uncreased edges
tspline,crease,uncrease

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreaseVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Adds a crease to the given set of vertices on a T-spline surface
vertices: Vertices to crease
Returns: TSpline surface with creased edges
tspline,edge,crease

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UncreaseVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Removes the crease from the given set of vertices
vertices: Vertices to uncrease
Returns: TSpline surface with uncreased edges
tspline,crease,uncrease

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
Welds the given list of vertices into a single vertex
vertices: Vertices to weld
newPosition: Position of the result vertex grip. Mean position of grips is used if null is passed.
keepSubdCreases: Preserve the subd-creases of the input topology
Returns: TSpline surface with welded vertices
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Boolean)
Weld vertices of first and second groups pairwise.
The first group is considered vertices of this T-spline.
The second group's vertices can be either from this surface or from any other.
In case of different T-splines, combine is performed before the weld operation.
firstGroup: First group of vertices to weld
secondGroup: Second group of vertices to weld
keepSubdCreases: Preserve the subd-creases of the input topology
Returns: TSpline surface with welded vertices
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldCoincidentVertices(System.Double)
Finds all coincident vertices and welds them together
tolerance: Tolerance to seek coincidence within
Returns: TSpline surface without coincident vertices
tspline,weld,coincident,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Unwelds all the given edges. Each vertex on all the edges will be unwelded.
edges: A set of edges to unweld
Returns: TSpline surface with unwelded edges
tspline,unweld,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Unwelds all the given vertices. All edges on every vertex will be unwelded.
vertices: A set of vertices to unweld
Returns: TSpline surface with unwelded vertices
tspline,unweld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Creates a match with a T-spline and a closed loop of curves
tsEdges: Closed T-Spline edge loop to create match with
curves: Closed curve loop to create match with
continuity: Geometry continuity to attempt to match: G0, G1, G2
useArclength: Wether to use arcLength alignment while building match
useRefinement: If true, extra control points will be added to the T-spline to match the surfaces within a given tole­rance.
numRefinementSteps: Max number of refinement steps. Ignored if useRefinement is set to false
refinementTolerance: Tolerance to hit. Ignored if useRefinement is set to false
usePropagation: Whether to use propagation while building match
widthOfPropagation: Determines how much of the surface is affected by the match. Ignored if usePropagation is set to false
scale: Tangent scale for G1 or curvature scale for G2. Ignored if continuity is G0.
flipSourceTargetAlignment: Whether to reverse the alignment direction
Returns: T-Spline surface positioned between given T-Spline border edges and curve loop
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Creates a match with a T-spline and a closed loop of BRep edges. First,
the edge loop is converted to a curve loop and then the match is performed.
tsEdges: Closed T-Spline edge loop to create match with
brepEdges: Closed BRep edge loop to create match with
continuity: Geometry continuity to attempt to match: G0, G1, G2
useArclength: Wether to use arcLength alignment while building match
useRefinement: If true, extra control points will be added to the T-spline to match the surfaces within a given tole­rance.
numRefinementSteps: Max number of refinement steps. Ignored if useRefinement is set to false
refinementTolerance: Tolerance to hit. Ignored if useRefinement is set to false
usePropagation: Whether to use propagation while building match
widthOfPropagation: Determines how much of the surface is affected by the match. Ignored if usePropagation is set to false
scale: Tangent scale for G1 or curvature scale for G2. Ignored if continuity is G0.
flipSourceTargetAlignment: Whether to reverse the alignment direction
Returns: T-Spline surface positioned between given T-Spline border edges and BRep edge loop
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeleteVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Removes vertices from T-spline topology
vertices: Vertex or vertices to delete
Returns: TSpline surface with deleted vertices
tspline,vertex,vertices,delete

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeleteEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Removes edges from T-spline topology
edges: Edge or edges to delete
Returns: TSpline surface with deleted edges
tspline,edge,delete

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeleteFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Removes faces from T-spline topology
faces: Face or faces to delete
Returns: TSpline surface with deleted faces
tspline,face,delete

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
Changes visualization style of a T-spline:
smooth visualization if True is passed, box otherwise
enable: Enable or disable smooth visualization
Returns: T-spline with chosen visualization style
tspline,visualization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExtrudeEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},Autodesk.DesignScript.Geometry.Vector,System.Int32)
Performs a single or multiple symmetric extrudes on a set of edges and moves new edges by the given vector
edges: A set of edges to extrude
direction: Vector to move new edges
spans: Amount of new segments that will be created
Returns: T-spline with extruded edges
tspline,extrude,direction,vector,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExtrudeFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},Autodesk.DesignScript.Geometry.Vector,System.Int32)
Performs a single or multiple symmetric extrudes on a set of faces and moves new edges by the given vector
faces: A set of faces to extrude
direction: Vector to move new faces
spans: Amount of new segments that will be created
Returns: t-spline with extruded faces
tspline,extrude,direction,vector,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExtrudeEdgesAlongCurve(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},Autodesk.DesignScript.Geometry.Curve,System.Int32)
Performs a single or multiple symmetric extrudes on a set of edges and moves new edges by the path of the given curve
edges: A set of edges to extrude
curve: The path, new edges will follow
spans: Amount of new segments that will be created
Returns: t-spline with extruded edges
tspline,extrude,curve,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExtrudeFacesAlongCurve(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},Autodesk.DesignScript.Geometry.Curve,System.Int32)
Performs a single or multiple symmetric extrudes on a set of faces and moves new edges by the path of the given curve
faces: A set of faces to extrude
curve: The path, new faces will follow
spans: Amount of new segments that will be created
Returns: t-spline with extruded faces
tspline,extrude,curve,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BevelEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Double,System.Int32,System.Boolean,System.Double)
Replaces given edges with a channel of faces
edges: A set of edges to replace of
percentage: The bevel will be contained to this percentage (between 0 and 1) of the faces neighboring the selected edge.
segments: The number of rows of faces in the channel
keepOnFace: Whether to create new faces on the box mode faces of the old model.
roundness: Determines how round or flat the bevel is. Takes values from 0 to 1.
Returns: T-Spline with beveled edges
tspline,bevel,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SlideEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Double,System.Double)
Slides the given edges along neighboring edges
edges: A set of edges to slide
amount: Edges will be slide this far (as a percentage between 0 and 1) toward the neighboring face.
roundness: Determines how round or flat the bevel is. Takes values from 0 to 1.
Returns: T-Spline with slided edges
tspline,slide,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MergeEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Boolean)
Merges the given edges. Edges in each group should create equal counts
of continuous sets. Edges from the first group are considered
edges of this surface. Edges from the second group can be either
from this surface or any other surface. In case of different
surfaces, combine is performed before merge.
firstGroup: First set of edges to merge
secondGroup: Second set of edges to merge
insertCreases: The surface will match the original surfaces more closely.
Returns: T-Spline surface with merged edges
tspline,merge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Builds a bridge between two sets of faces. Items of the first group
are considered children of this surface. Items of the second
group can be either children of this surface or belong to
a different surface. Topology within each group might not be adjacent
but should create the same count of distinct loops.
firstGroup: First group of faces to bridge
secondGroup: Second group of faces to bridge
followCurves: Bridging curves for each distinct topology
loop (straight lines are used if empty list is passed, if one curve
passed it is replicated if more than one input loop is detected)
frameRotations: Number of full rotations around
the normal of the frames along the bridging curve for each distinct
loop of topology (0 is used if empty list is passed, if one value
passed it is replicated if more than one input loop is detected)
spansCounts: Number os segments along the bridge for
each distinct topology loop. Span count for each group should be
greater than corresponding number of rotations (1 is used if empty
list is passed, if one value passed it is replicated if more than
one input loop is detected)
cleanBorderBridges: Delete bridges between border edges.
keepSubdCreases: Preserve the subd-creases of the
input topology
firstAlignVertices: List of orient vertices for
each distinct topology loop from the first group (The number of vertices should
be the same as detected input loops or list can be empty)
secondAlignVertices: List of orient vertices for
each distinct topology loop from the second group (The number of vertices should
be the same as detected input loops or list can be empty)
flipAlignmentFlags: List of flags indicating whether
to flip alignment of bridge for corresponding topology loop.
(false is set if empty list is passed, if one value passed it is replicated
for each detected input loop)
Returns: TSpline surface with topology, connected by bridge
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Builds a bridge between a set of faces and a set of edges. Items of the
first group are considered children of this surface. Items of
the second group can be either children of this surface or belong
to a different surface. Topology within each group might not be
adjacent but should create the same count of distinct loops.
firstGroup: First group of faces to bridge
secondGroup: Second group of edges to bridge
followCurves: Bridging curves for each distinct topology
loop (straight lines are used if empty list is passed, if one curve
passed it is replicated if more than one input loop is detected)
frameRotations: Number of full rotations around
the normal of the frames along the bridging curve for each distinct
loop of topology (0 is used if empty list is passed, if one value
passed it is replicated if more than one input loop is detected)
spansCounts: Number os segments along the bridge for
each distinct topology loop. Span count for each group should be
greater than corresponding number of rotations (1 is used if empty
list is passed, if one value passed it is replicated if more than
one input loop is detected)
cleanBorderBridges: Delete bridges between border edges.
keepSubdCreases: Preserve the subd-creases of the
input topology
firstAlignVertices: List of orient vertices for
each distinct topology loop from the first group (The number of vertices should
be the same as detected input loops or list can be empty)
secondAlignVertices: List of orient vertices for
each distinct topology loop from the second group (The number of vertices should
be the same as detected input loops or list can be empty)
flipAlignmentFlags: List of flags indicating whether
to flip alignment of bridge for corresponding topology loop.
(false is set if empty list is passed, if one value passed it is replicated
for each detected input loop)
Returns: TSpline surface with topology, connected by bridge
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Builds a bridge between a set of edges and a set of faces. Items of the
first group are considered children of this surface. Items of
the second group can be either children of this surface or belong
to a different surface. Topology within each group might not be
adjacent but should create the same count of distinct loops.
firstGroup: First group of edges to bridge
secondGroup: Second group of faces to bridge
followCurves: Bridging curves for each distinct topology
loop (straight lines are used if empty list is passed, if one curve
passed it is replicated if more than one input loop is detected)
frameRotations: Number of full rotations around
the normal of the frames along the bridging curve for each distinct
loop of topology (0 is used if empty list is passed, if one value
passed it is replicated if more than one input loop is detected)
spansCounts: Number os segments along the bridge for
each distinct topology loop. Span count for each group should be
greater than corresponding number of rotations (1 is used if empty
list is passed, if one value passed it is replicated if more than
one input loop is detected)
cleanBorderBridges: Delete bridges between border edges.
keepSubdCreases: Preserve the subd-creases of the
input topology
firstAlignVertices: List of orient vertices for
each distinct topology loop from the first group (The number of vertices should
be the same as detected input loops or list can be empty)
secondAlignVertices: List of orient vertices for
each distinct topology loop from the second group (The number of vertices should
be the same as detected input loops or list can be empty)
flipAlignmentFlags: List of flags indicating whether
to flip alignment of bridge for corresponding topology loop.
(false is set if empty list is passed, if one value passed it is replicated
for each detected input loop)
Returns: TSpline surface with topology, connected by bridge
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Builds a bridge between two sets of edges. Items of the
first group are considered children of this surface. Items of
the second group can either be children of this surface or belong
to a different surface. Topology within each group might not be
adjacent but should create the same count of distinct loops.
firstGroup: First group of edges to bridge
secondGroup: Second group of edges to bridge
followCurves: Bridging curves for each distinct topology
loop (straight lines are used if empty list is passed, if one curve
passed it is replicated if more than one input loop is detected)
frameRotations: Number of full rotations around
the normal of the frames along the bridging curve for each distinct
loop of topology (0 is used if empty list is passed, if one value
passed it is replicated if more than one input loop is detected)
spansCounts: Number os segments along the bridge for
each distinct topology loop. Span count for each group should be
greater than corresponding number of rotations (1 is used if empty
list is passed, if one value passed it is replicated if more than
one input loop is detected)
cleanBorderBridges: Delete bridges between border edges.
keepSubdCreases: Preserve the subd-creases of the
input topology
firstAlignVertices: List of orient vertices for
each distinct topology loop from the first group (The number of vertices should
be the same as detected input loops or list can be empty)
secondAlignVertices: List of orient vertices for
each distinct topology loop from the second group (The number of vertices should
be the same as detected input loops or list can be empty)
flipAlignmentFlags: List of flags indicating whether
to flip alignment of bridge for corresponding topology loop.
(false is set if empty list is passed, if one value passed it is replicated
for each detected input loop)
Returns: TSpline surface with topology, connected by bridge
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
Fills holes in a T-spline
edges: Set of edges with hole inside. Edges must be border.
fillMethod: Method for filling hole: 0 - tesselation, 1 - ngons, 2 - collapse, 3 - collapse and weld
keepSubdCreases: Preserve the subd-creases of the input topology
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.AddReflections(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineReflection},System.Boolean,System.Double)
Appends the given list of reflections to a T-Spline
reflections: List of reflections
weldSymmetricPortions: Whether to weld symmetric portions
weldTolerance: Tolerance to weld symmetric portions
Returns: T-Spline surface with new reflections appended

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.RemoveReflections
Removes all reflections from the given T-spline
Returns: T-Spline surface with given reflections removed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
Compresses all topology on an input surface and makes the indices contiguous. This function maintains the relative order of the indices.
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SubdivideFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Boolean)
Subdivides the given faces into four faces each in exact or simple mode
depending on the 'exact' input
faces: List of faces to subdivide
exact: If false, resulting surface can be flatter and sharper than the original,
if true, it keeps its original shape
Returns: T-Spline with given faces subdivided
tspline,subdivide,faces,simple

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
Interpolates a given T-spline surface. Forward interpolation moves control points to their parametric locations on the surface. Reverse interpolation generates a point on the surface for each original control point and moves this control point to its corresponding surface point.
reverse: Interpolation direction: forward if false, reverse otherwise
Returns: Interpolated T-Spline in given direction
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.PullVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.Boolean)
Takes every given T-spline vertex and pulls it towards the closest point
point on the target geometries. If 'surfacePoints' is True, the surface point
of the vertex is pulled. If False, the control grip is pulled.
vertices: List of vertices to pull
geometries: List of geometries to pull to
surfacePoints: Flag, indicating whether to use surface or control points of vertices
Returns: T-Spline Surface with pulled vertices
tspline,pull,vertices

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Flattens control points of given vertices to a single plane.
Requires input of at least four vertices.
vertices: List of vertices
Returns: T-SPline Surface with flattened vertices
tspline,flatten,vertices

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Plane)
Flattens control points of given vertices to a single plane
that will be parallel with the given plane.
Requires input of at least four vertices.
vertices: List of vertices
parallelPlane: Plane to fit vertices parallel to
Returns: T-SPline Surface with flattened vertices
tspline,flatten,vertices,fitparallel

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Copies given faces to a new T-spline surface with no symmetry
faces: Faces to duplicate
Returns: T-Spline Surface with chosen faces only
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlipNormals
Inverts the normals of all faces in the mesh
Returns: T-Spline Surface with inverted normals
tspline,flip,normal,vector

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MakeUniform
Makes all knot intervals on a T-spline surface uniform
Returns: T-Spline Surface with uniform internals
tspline,knot,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Standardize
Standardizes the given T-spline to the point where exact insertion
can be performed. If it cannot be standardized, a warning is shown
explaining the reason.
Returns: Standardized T-Spline Surface
tspline,standardize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Moves the given vertices along the given vector
vertices: Vertex list to be moved
vector: Direction to move along
onSurface: Flag, indicating whether to use surface or control points of vertices
Returns: